DataProcessors/РабочийСтолФинансов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>РабочийСтолФинансов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ДеньгиОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДеньгиОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/РабочийСтолФинансов/Forms/ФормаРабочийСтол/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьАктуальнымиДанными();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбщийОстатокСредств()	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДеньгиОстаткиОстатки.МестоХранения КАК МестоХранения,
	               |	ДеньгиОстаткиОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ДеньгиОстатки.Остатки КАК ДеньгиОстаткиОстатки";
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗРезультат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьАктуальнымиДанными()
	
	ТаблицаОстатокСредств.Загрузить(ПолучитьОбщийОстатокСредств());
	ИтогоСредств = ТаблицаОстатокСредств.Итог("Количество");

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ЗаполнитьАктуальнымиДанными();
	
КонецПроцедуры
